driver-tests/httpsoapbc/soapencoding/InvokeGoogleJBI/test/TestCase0/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:echo="http://stc.com/echo">
  <soapenv:Body>
    <echo:item>
      <echo:key>uTl0tCZQFHKxG66ZegzxQOPyX0QD2AzO</echo:key>
      <echo:queryString>soap encoding</echo:queryString>
      <echo:startIndex>0</echo:startIndex>
      <echo:maxResults>10</echo:maxResults>
      <echo:filter>false</echo:filter>
      <echo:restricts>none</echo:restricts>
      <echo:safesearch>true</echo:safesearch>
      <echo:languageRestriction>latin1</echo:languageRestriction>
      <echo:ie></echo:ie>
      <echo:oe></echo:oe>
    </echo:item>
  </soapenv:Body>
</soapenv:Envelope>