driver-tests/httpsoapbc/siebel/siebelAccountCompositeAp/test/TestCase0/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:echo="http://stc.com/echo">
  <soapenv:Body>
    <echo:item>
      <echo:value>bryan</echo:value>
    </echo:item>
  </soapenv:Body>
</soapenv:Envelope>